let coinList = [	["리플"],
                    ["비트토렌트"],
                    ["비트코인골드"],
                    ["비트코인"],
                    ["메디블록"],
                    ["퀀텀"],
                    ["이더리움클래식"],
                    ["비트코인캐시에이비씨"],
                    ["코모도"],
                    ["넴"],
                    ["플로우"],
                    ["메타디움"],
                    ["엔진코인"],
                    ["이오스"],
                    ["이더리움"],
                    ["밀크"],
                    ["비트코인캐시"],
                    ["마로"],
                    ["칠리즈"],
                    ["도지코인"],
                    ["스톰엑스"],
                    ["엔도르"],
                    ["엠블"],
                    ["에이다"],
                    ["무비블록"],
                    ["펀디엑스"],
                    ["스텔라루멘"],
                    ["톤"],
                    ["보라"],
                    ["트론"],
                    ["크립토닷컴체인"],
                    ["비체인"],
                    ["오미세고"],
                    ["썸씽"],
                    ["네오"],
                    ["캐리프로토콜"],
                    ["스테이터스네트워크토큰"],
                    ["던프로토콜"],
                    ["휴먼스케이프"],
                    ["쎼타토큰"],
                    ["페이코인"],
                    ["디카르고"],
                    ["라이트코인"],
                    ["페타퓨엘"],
                    ["메탈"],
                    ["비트코인에스브이"],
                    ["리퍼리움"],
                    ["테조스"],
                    ["체인링크"],
                    ["스와이프"],
                    ["온돌로지"],
                    ["픽셀"],
                    ["옵저버"],
                    ["폴카닷"],
                    ["람다"],
                    ["제로엑스"],
                    ["스팀"],
                    ["썬더토큰"],
                    ["리스크"],
                    ["어거"],
                    ["앵커"],
                    ["어거"],
                    ["퀴즈톡"],
                    ["시아코인"],
                    ["코박토큰"],
                    ["샌드박스"],
                    ["오브스"],
                    ["피르마체인"],
                    ["카비"],
                    ["모스코인"],
                    ["플레이댑"],
                    ["헤데라해시그래프"],
                    ["디센트럴랜드"],
                    ["센티넬프로토콜"],
                    ["아크"],
                    ["스텍스"],
                    ["에브리피디아"],
                    ["가스"],
                    ["아하토큰"],
                    ["트웰브쉽스"],
                    ["쿼크체인"],
                    ["아이오에스티"],
                    ["스팀달러"],
                    ["에스티피"],
                    ["코스모스"],
                    ["알파쿼크"],
                    ["메인프레임"],
                    ["엑시인피니티"],
                    ["파워렛저"],
                    ["헌트"],
                    ["아이콘"],
                    ["저스트"],
                    ["아르고"],
                    ["에드엑스"],
                    ["세럼"],
                    ["엘비알와이크레딧"],
                    ["온돌로지가스"],
                    ["스토리지"],
                    ["폴리매쓰"],
                    ["왁스"],
                    ["솔브케어"],
                    ["카이버네트워크"],
                    ["베이직어텐션토큰"],
                    ["질리카"],
                    ["웨이브"],
                    ["그로스톨코인"],
                    ["시빅"],
                    ["디마켓"],
                    ["이그니스"],
                    ["스트라티스"],
                    ["아더"],
                    ["아이오타"],
                    ["엘프"],
                    ["룸네트워크"],
                    ["스트라이크"],
                    ["아인스타이늄"],
                    ["골렘"],
                    ["하이브"],
]

                  
                  
                  
                    


function random(data) {

    lotCnt= 1;	//추첨인원
    datalotCnt = data.length;	//자료수
    coinPick = new Array(datalotCnt);	//당첨번호
    coinPick[0] = 0;

    for (let i=0; i<=lotCnt; i++)
    {
      flag = 0;

      while(flag === 0) {
        result=Math.floor(Math.random() * datalotCnt);

        for(let j=0; j<=i; j++) {
           if (result == coinPick[j]) {
            flag = 0;
            break;
           } else {
            flag = 1;
           }
        }
      }

      coinPick[i] = result;
    }

    temp = 0;

    for (let i=0; i<=lotCnt-1; i++)  {
      for (let j=i+1; j<=lotCnt; j++) {
        if (coinPick[i] > coinPick[j]) {
          temp= coinPick[i];
          coinPick[i] = coinPick[j];
          coinPick[j] = temp;
        }
      }
    }

    
    for (let i=1; i<=lotCnt; i++) 
    {
     console.log(data[coinPick[i]][0]);
     const coinShow = document.querySelector(".kk");
     coinShow.innerText = `${data[coinPick[i]][0]}`;
    
    }

}


